package epamOnline.chapter_2.sortings;

//5. Сортировка вставками. Дана последовательность чисел n aaa , ,, 21  .
// Требуется переставить числа в порядке возрастания.
// Делается это следующим образом.
// Пусть i aaa , ,, 21  - упорядоченная последовательность, т. е. na aa    21 .
// Берется следующее число 1 +ia и вставляется в последовательность так,
// чтобы новая последовательность была тоже возрастающей.
// Процесс производится до тех пор, пока все элементы от i +1 до n не будут перебраны.
// Примечание. Место помещения очередного элемента в отсортированную часть
// производить с помощью двоичного поиска. Двоичный поиск оформить в виде отдельной функции.

public class Task5InsertionSort {
    public static void main(String[] args) {

    }
}
