package epamOnline.chapter_2.sortings;

//Сортировка обменами. Дана последовательность чисел n aaa  2 1 .
// Требуется переставить числа в порядке возрастания.
// Для этого сравниваются два соседних числа 1 +ii aиa .
// Если 1 + ii a a , то делается перестановка.
// Так продолжается до тех пор, пока все элементы не станут расположены в порядке возрастания.
// Составить алгоритм сортировки, подсчитывая при этом количества перестановок.

public class Task4BubbleSort {
    public static void main(String[] args) {

    }
}
